app/controllers/access_keys_controller.rb

INSERT INTO `access_keys` (`expiration_date`, `updated_at`, `user_id`, `key`, `school_id`, `created_at`) VALUES('2009-09-28', '2009-09-28 03:37:52', NULL, 'f21e2a', NULL, '2009-09-28 03:37:52')
INSERT INTO `user_school_associations` (`access_key_id`, `updated_at`, `role_id`, `user_id`, `school_id`, `created_at`) VALUES(2, '2009-09-28 03:39:36', NULL, NULL, 1, '2009-09-28 03:39:36')
---
 def grant_keys_to_school
   n = params[:number].to_i
   for k in 0...n do
      ak = AccessKey.create(:expiration_date => (params[:exp_date] ? params[:exp_date] : Time.now))
      UserSchoolAssociation.create(:school_id => params[:id].to_i, :access_key => ak)

SELECT * FROM `access_keys` WHERE (`access_keys`.`id` = 0)
---
  def show
    @access_key = AccessKey.find(params[:id])