app/controllers/activities_controller.rb

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
DELETE FROM `activities` WHERE `id` = 1