app/controllers/admin_controller.rb

SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `users` ORDER BY users.created_at DESC LIMIT 0, 13
SELECT count(users.id) AS count_users_id FROM `users`
---
    def users
    @users = User.paginate(:conditions => ["removed = 0"],
      :page => params[:page],
      :order => 'created_at ASC',
      :per_page => 20)

SELECT * FROM `pages` WHERE (published_as = 'live')
---
  def events
    @events = Event.find(:all, :order => 'start_time DESC', :page => {:current => params[:page]})

SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def activate_user
    user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def deactivate_user
    user = User.find(params[:id])