app/controllers/base_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
---
  def find_user
    # if @user = User.active.find(params[:user_id] || params[:id])
    if @user = User.find(params[:user_id] || params[:id])