app/controllers/clippings_controller.rb

SELECT * FROM `clippings` WHERE ((created_at > '2009-08-23 15:16:07')) ORDER BY clippings.favorited_count DESC LIMIT 0, 2
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `tags` WHERE (`tags`.`id` = 2)
SELECT count(DISTINCT clippings.id) AS count_clippings_id FROM `clippings` LEFT OUTER JOIN `taggings` ON (`clippings`.`id` = `taggings`.`taggable_id` AND `taggings`.`taggable_type` = 'Clipping') LEFT OUTER JOIN `tags` ON (`tags`.`id` = `taggings`.`tag_id`) WHERE ((created_at > '2009-08-23 15:16:07'))
---
  def site_index
    cond = Caboose::EZ::Condition.new
    if params[:tag_name]
      cond.append ['tags.name = ?', params[:tag_name]]
    end

    cond.append ['created_at > ?', 4.weeks.ago] unless params[:recent]
    order = (params[:recent] ? "created_at DESC" : "clippings.favorited_count DESC")


    @clippings = Clipping.find(:all,
      :page => {:size => 30, :current => params[:page]},
      :order => order,
      :conditions => cond.to_sql,
      :include => :tags
      )

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
SELECT * FROM `clippings` WHERE (user_id = 1) ORDER BY created_at DESC LIMIT 0, 2
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(DISTINCT clippings.id) AS count_clippings_id FROM `clippings` LEFT OUTER JOIN `taggings` ON (`clippings`.`id` = `taggings`.`taggable_id` AND `taggings`.`taggable_type` = 'Clipping') LEFT OUTER JOIN `tags` ON (`tags`.`id` = `taggings`.`tag_id`) WHERE (user_id = 1)
SELECT tags.id, tags.name, COUNT(*) AS count FROM `tags` INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN clippings ON clippings.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Clipping' AND `clippings`.`user_id` = 1) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0 LIMIT 20
---
  def index
    @user = User.find(params[:user_id])

    cond = Caboose::EZ::Condition.new
    cond.user_id == @user.id
    if params[:tag_name]
      cond.append ['tags.name = ?', params[:tag_name]]
    end

    @clippings = Clipping.find(:all,
      :page => {:size => 30, :current => params[:page]},
      :order => "created_at DESC",
      :conditions => cond.to_sql,
      :include => :tags )

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
SELECT * FROM `clippings` WHERE (`clippings`.user_id = 1 AND (created_at < '2009-09-19 15:15:58')) ORDER BY created_at DESC, created_at desc LIMIT 1
---
  def show
    @user = User.find(params[:user_id])
    @clipping = Clipping.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM `clippings` WHERE (`clippings`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
---
  def edit
    @clipping = Clipping.find(params[:id])
    @user = User.find(params[:user_id])

INSERT INTO `clippings` (`image_url`, `updated_at`, `url`, `description`, `favorited_count`, `user_id`, `created_at`) VALUES('http://www.google.com/intl/en/images/logo.gif', '2009-09-20 15:16:05', 'http://www.google.com', NULL, 0, 1, '2009-09-20 15:16:05')
INSERT INTO `tags` (`name`) VALUES('tag1')
---
  def create
    @user = current_user
    @clipping = @user.clippings.new(params[:clipping])
    @clipping.user = @user
    @clipping.tag_list = params[:tag_list] || ''


    # primeiro salva clipping !


    #@res = Resource.new
    #@res.title = @clipping.title
    #@res.owner = @clipping.user

  #  @res.resource =

    respond_to do |format|
      if @clipping.save!

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `clippings` WHERE (`clippings`.`id` = 1)
UPDATE `clippings` SET `updated_at` = '2009-09-20 15:16:10', `url` = 'changed url' WHERE `id` = 1
---
  def update
    @user = User.find(params[:user_id])
    @clipping = Clipping.find(params[:id])
    @clipping.tag_list = params[:tag_list] || ''

    respond_to do |format|
      @clipping.save!

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `clippings` WHERE (`clippings`.`id` = 1)
DELETE FROM `clippings` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:user_id])
    @clipping = Clipping.find(params[:id])
    @clipping.destroy