app/controllers/comments_controller.rb

  def index

    @commentable = comment_type.constantize.find(comment_id)

    #don't use the get_type, as we want the specific case where the user typed /User/username/comments
    redirect_to user_comments_path(params[:commentable_id]) and return if (params[:commentable_type] && params[:commentable_type].camelize == "User")

    unless logged_in? || @commentable && (!@commentable.owner.nil? && @commentable.owner.profile_public?)
      flash.now[:error] = :this_users_profile_is_not_public_youll_need_to_create_an_account_and_log_in_to_access_it.l
      redirect_to :controller => 'sessions', :action => 'new' and return
    end

    if @commentable

      @comments = @commentable.comments.recent.find(:all, :page => {:size => 10, :current => params[:page]})
---
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 2 AND `comments`.commentable_type = 'User') AND (`comments`.commentable_id = 2 AND `comments`.commentable_type = 'User') ORDER BY created_at DESC LIMIT 0, 2
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(comments.id) AS count_comments_id FROM `comments` WHERE (`comments`.commentable_id = 2 AND `comments`.commentable_type = 'User') AND (`comments`.commentable_id = 2 AND `comments`.commentable_type = 'User')

  def create
    @commentable = comment_type.constantize.find(comment_id)

    @comment = Comment.new(params[:comment])

    @comment.commentable = @commentable
    @comment.recipient = @commentable.owner
    @comment.user_id = current_user.id if current_user
    @comment.author_ip = request.remote_ip #save the ip address for everyone, just because

    respond_to do |format|
      if (logged_in? || verify_recaptcha(@comment)) && @comment.save
---
INSERT INTO `comments` (`commentable_type`, `title`, `author_name`, `commentable_id`, `recipient_id`, `user_id`, `author_email`, `comment`, `author_url`, `author_ip`, `created_at`, `notify_by_email`) VALUES('Photo', 'test comment on a photo', NULL, 1, 1, 2, NULL, 'hey man, nice pic?', NULL, '0.0.0.0', '2009-09-20 15:16:17', 1)

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.can_be_deleted_by(current_user) && @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
DELETE FROM `comments` WHERE `id` = 1

  def unsubscribe
    @comment = Comment.find(params[:comment_id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 24)