app/controllers/courses_controller.rb

  def index

    if params[:user_id] # aulas do usuario
      @user = User.find_by_login(params[:user_id])
      @user = User.find(params[:user_id]) unless @user

      @courses = @user.courses.paginate :page => params[:page], :per_page => AppConfig.items_per_page
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `courses`
SELECT * FROM `pages` WHERE (published_as = 'live')

  def show


 #   @course = Course.find(params[:id]) # ja pego no verify_access
    update_view_count(@course)

    if @course.removed
      redirect_to removed_page_path and return
    end


      #comentários
      @comments  = @course.comments.find(:all, :limit => 10, :order => 'created_at DESC')

      # anotações
      @annotation = @course.has_annotations_by(current_user)
      @annotation = Annotation.new unless @annotation

      #relacionados
      related_name = @course.name
      @related_courses = Course.find(:all,:conditions => ["name LIKE ? AND id NOT LIKE ?","%#{related_name}%", @course.id] , :limit => 3, :order => 'created_at DESC')

     #@course.update_attribute(:view_count, @course.view_count + 1) #TODO em Viewable

     # Log.log_activity(@course, 'show', current_user, @school)#TODO se usuario nao comprou não logar atividade

      respond_to do |format|
        if @course.courseable_type == 'Page'
        elsif @course.courseable_type == 'InteractiveClass'
          @lessons = Lesson.all(:conditions => ['interactive_class_id = ?',@course.courseable_id ], :order => 'position ASC') # TODO 2 consultas?
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `pages` WHERE (published_as = 'live')

  def create
    #TODO diminuir a lógica desse método
    # cam2: vou ver isso a diante, mas nao vai melhorar perfomace
    case params[:step]
      when "1"
          @course = Course.new(params[:course])
          @course.owner = current_user
          @course.enable_validation_group :step1

          respond_to do |format|
            if @course.save
---
INSERT INTO `courses` (`name`, `updated_at`, `created_at`) VALUES('Vida Severina', '2009-09-29 20:39:02', '2009-09-29 20:39:02')

  def update

   # Log.log_activity(@course, 'update', @course.owner, @school)

   @course = Course.find(params[:id])

   if @course.courseable_type == 'InteractiveClass'
     @interactive_class = @course.interactive_class
     respond_to do |format|
      if @interactive_class.update_attributes(params[:interactive_class])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
UPDATE `courses` SET `updated_at` = '2009-09-29 21:42:31', `name` = 'Vida Severina - João Cabral ' WHERE `id` = 1

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
DELETE FROM `courses` WHERE `id` = 2