app/controllers/events_controller.rb

SELECT * FROM `events`
---
  def ical
    @calendar = Icalendar::Calendar.new
    @calendar.custom_property('x-wr-caldesc',"#{AppConfig.community_name} #{:events.l}")
    Event.find(:all).each do |event|
      ical_event = Icalendar::Event.new
      ical_event.start = event.start_time.strftime("%Y%m%dT%H%M%S")
      ical_event.end = event.end_time.strftime("%Y%m%dT%H%M%S")
      #ical_event.summary = event.name + (event.metro_area.blank? ? '' : " (#{event.metro_area})")
      coder = HTMLEntities.new
      ical_event.description = (event.description.blank? ? '' : coder.decode(help.strip_tags(event.description).to_s) + "\n\n") + event_url(event)

SELECT * FROM `events` WHERE (end_time > '2009-09-20 16:17:07') ORDER BY start_time LIMIT 0, 2
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(events.id) AS count_events_id FROM `events` WHERE (end_time > '2009-09-20 16:17:07')
---
  def index
    @events = Event.approved.upcoming.paginate(:conditions => ["space_id = ? AND state LIKE 'approved'", Space.find(params[:space_id]).id],
                                      :include => :owner,
                                      :page => params[:page],
                                      :order => 'start_time',
                                      :per_page => AppConfig.items_per_page)

SELECT * FROM `events` WHERE (end_time <= '2009-09-20 16:17:07') ORDER BY start_time DESC LIMIT 0, 3
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(events.id) AS count_events_id FROM `events` WHERE (end_time <= '2009-09-20 16:17:07')
---
  def past
    @events = Event.past.paginate(:conditions => ["space_id = ? AND state LIKE 'approved'", Space.find(params[:space_id]).id],
                                  :include => :owner,
                                  :page => params[:page],
                                  :order => 'start_time DESC',
                                  :per_page => AppConfig.items_per_page)

INSERT INTO `events` (`name`, `updated_at`, `description`, `metro_area_id`, `user_id`, `created_at`, `start_time`, `end_time`, `location`) VALUES('New event', '2009-09-20 15:17:07', 'A great event', NULL, 4, '2009-09-20 15:17:07', '2009-09-19 15:17:07', '2009-09-20 15:17:07', NULL)
UPDATE `users` SET `login_slug` = 'administrator', `activities_count` = 1, `updated_at` = '2009-09-20 15:17:07' WHERE `id` = 4
---
  def create
    # Passando para o formato do banco
    params[:event][:start_time] = Time.zone.parse(params[:event][:start_time].gsub('/', '-'))
    params[:event][:end_time] = Time.zone.parse(params[:event][:end_time].gsub('/', '-'))

    @event = Event.new(params[:event])
    @event.owner = current_user
    @event.space = Space.find(params[:space_id])

    @space = @event.space

    respond_to do |format|
      if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 1)
UPDATE `events` SET `metro_area_id` = NULL, `updated_at` = '2009-09-20 15:17:08', `name` = 'changed name' WHERE `id` = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT * FROM `events` WHERE (`events`.`id` = 1)
DELETE FROM `events` WHERE `id` = 1
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy