app/controllers/favorites_controller.rb

SELECT * FROM `favorites` WHERE (user_id = 1 AND favoritable_type = 'Clipping' AND favoritable_id = 1) LIMIT 1
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(favorites.id) AS count_favorites_id FROM `favorites` WHERE (user_id = 1)
---
  def index
    @user = current_user
    respond_to do |format|
      case params[:type]
      when 'exams'
        @exams = Exam.paginate(:all,
                               :joins => :favorites,
                               :conditions => ["favorites.favoritable_type = 'Exam' AND favorites.user_id = ? AND exams.id = favorites.favoritable_id", current_user.id],
                               :page => params[:page], :order => 'created_at DESC', :per_page => AppConfig.items_per_page)