app/controllers/forums_controller.rb

  def show
    respond_to do |format|
      format.html do
        # keep track of when we last viewed this forum for activity indicators
        (session[:forums] ||= {})[@forum.id] = Time.now.utc if logged_in?

        @topics = @forum.topics.paginate(:page => params[:page],
                                        :include => :replied_by_user,
          :order => 'sticky DESC, replied_at DESC',
                                        :per_page => 20)
---
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `topics` WHERE (`topics`.forum_id = 1) ORDER BY sticky DESC, replied_at DESC, sticky desc, replied_at desc LIMIT 0, 4
SELECT `users`.* FROM `users` INNER JOIN `moderatorships` ON `users`.id = `moderatorships`.user_id WHERE ((`moderatorships`.forum_id = 1))
SELECT count(*) AS count_all FROM `users` INNER JOIN `moderatorships` ON `users`.id = `moderatorships`.user_id WHERE ((`moderatorships`.forum_id = 1))

  def create
    @forum.attributes = params[:forum]
    @forum.tag_list = params[:tag_list] || ''
    @forum.save!
---
INSERT INTO `forums` (`name`, `topics_count`, `description_html`, `description`, `owner_id`, `sb_posts_count`, `position`, `owner_type`) VALUES('yeah', 0, '', NULL, NULL, 0, 1, NULL)
INSERT INTO `tags` (`name`) VALUES('tag1')

  def update
    @forum.attributes = params[:forum]
    @forum.tag_list = params[:tag_list] || ''
    @forum.save!
---
INSERT INTO `tags` (`name`) VALUES('tagX')
UPDATE `forums` SET `description_html` = '' WHERE `id` = 1

  def destroy
    @forum.destroy
---
DELETE FROM `forums` WHERE `id` = 1

    def find_or_initialize_forum
      @forum = params[:id] ? Forum.find(params[:id]) : Forum.new
---
SELECT * FROM `forums` WHERE (1 = 1) ORDER BY position DESC LIMIT 1