app/controllers/forums_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IN (1,2))
---
  def show
    @forum = @space.forum
    respond_to do |format|
      # keep track of when we last viewed this forum for activity indicators
      (session[:forums] ||= {})[@forum.id] = Time.now.utc if logged_in?

      @topics = @forum.topics.includes(:replied_by_user).
                  paginate(:page => params[:page],
                           :order => 'locked DESC, replied_at DESC',
                           :per_page => 20)