app/controllers/friendships_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `friendships` WHERE `id` = 1
---
  def destroy
    @friend = User.find(@friendship.friend_id)
    @user.destroy_friendship_with(@friend)