app/controllers/invitations_controller.rb

  def create
    @user = current_user
    @inviteable = find_inviteable

    @invitation = Invitation.new(params[:invitation])
    @invitation.user = @user
    @invitation.inviteable = @inviteable
    @invitation.role = Role[:teacher] if @invitation.inviteable_type == 'Course'

    respond_to do |format|
      if @invitation.save
        @user.update_attribute(:has_invited, true)
---
INSERT INTO `invitations` (`message`, `email_addresses`, `user_id`, `created_at`) VALUES('sup dude', 'asdf@asdf.com', 1, '2009-09-20 15:18:52')
UPDATE `users` SET `activities_count` = 1, `updated_at` = '2009-09-20 15:18:52' WHERE `id` = 1