app/controllers/messages_controller.rb

  def index
    if params[:mailbox] == "sent"
      @messages = @user.sent_messages.paginate(:all, :page => params[:page],
                                               :order =>  'created_at DESC',
                                               :per_page => AppConfig.items_per_page)
---
SELECT * FROM `messages` WHERE (`messages`.recipient_id = 3 AND (recipient_deleted = 0)) ORDER BY created_at DESC LIMIT 0, 0
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(messages.id) AS count_messages_id FROM `messages` WHERE (`messages`.recipient_id = 3 AND (recipient_deleted = 0))

  def create
    messages = []

    if params[:message][:to].blank?
      # If 'to' field is empty, call validations to catch other
      @message = Message.new(params[:message])
      @message.valid?

      respond_to do |format|
        format.html do
          render :action => :new and return
        end
        format.js do
          render :update do |page|
            page << "jQuery('#msg_spinner').hide()"
            page.replace_html "errors", error_messages_for(:message)
          end
        end
      end
    else
      # If 'to' field isn't empty then make sure each recipient is valid
      params[:message][:to].split(',').uniq.each do |to|
        @message = Message.new(params[:message])
        @message.recipient = User.find_by_login(to.strip)
---
SELECT * FROM `users` WHERE (`users`.`login` = 'professor2') LIMIT 1

          end
          return
        else
          messages << @message
---
INSERT INTO `messages` (`recipient_deleted`, `updated_at`, `body`, `recipient_id`, `subject`, `read_at`, `sender_deleted`, `sender_id`, `created_at`) VALUES(0, '2009-10-01 19:52:01', 'professor ruim', 9, 'preciso falar', NULL, 0, 5, '2009-10-01 19:52:01')

  def find_user
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1