app/controllers/metro_areas_controller.rb

  def index
    @metro_areas = MetroArea.find :all, :page => {:current => params[:page]}, :order => "countries.name, metro_areas.name", :include => :country
---
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT count(DISTINCT metro_areas.id) AS count_metro_areas_id FROM `metro_areas` LEFT OUTER JOIN `countries` ON `countries`.id = `metro_areas`.country_id

  def show
    @metro_area = MetroArea.find(params[:id])
---
SELECT * FROM `metro_areas` WHERE (`metro_areas`.`id` = 1)

  def edit
    @metro_area = MetroArea.find(params[:id])
---
SELECT * FROM `metro_areas` WHERE (`metro_areas`.`id` = 1)

  def create
    @metro_area = MetroArea.new(params[:metro_area])

    respond_to do |format|
      if @metro_area.save
---
INSERT INTO `metro_areas` (`name`, `country_id`, `users_count`, `state_id`) VALUES('Dusseldorf', 1, 0, NULL)

  def update
    @metro_area = MetroArea.find(params[:id])
---
SELECT * FROM `metro_areas` WHERE (`metro_areas`.`id` = 1)

  def destroy
    @metro_area = MetroArea.find(params[:id])
    @metro_area.destroy
---
SELECT * FROM `metro_areas` WHERE (`metro_areas`.`id` = 1)
DELETE FROM `metro_areas` WHERE `id` = 1