app/controllers/posts_controller.rb

SELECT * FROM `clippings` WHERE (created_at > '2009-09-13 15:19:20') ORDER BY created_at DESC LIMIT 15
---
  def recent
    @posts = Post.recent.find :all, :page => {:current => params[:page], :size => 20}

    @recent_clippings = Clipping.find_recent(:limit => 15)