app/controllers/posts_controller.rb

  def manage
    @posts = @user.posts.find_without_published_as(:all,
      :page => {:current => params[:page], :size => 10},
      :order => 'created_at DESC')
---
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `posts` WHERE (`posts`.user_id = 16) ORDER BY created_at DESC, published_at desc LIMIT 0, 0
SELECT count(posts.id) AS count_posts_id FROM `posts` WHERE (`posts`.user_id = 16)

  def index
    @user = User.find(params[:user_id])
    @category = Category.find_by_name(params[:category_name]) if params[:category_name]
    cond = Caboose::EZ::Condition.new
    if @category
      cond.append ['category_id = ?', @category.id]
    end

    @posts = @user.posts.recent.find :all, :conditions => cond.to_sql, :page => {:size => 10, :current => params[:page]}
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `posts` WHERE (`posts`.user_id = 1) AND ((`posts`.user_id = 1) AND (published_as = 'live')) ORDER BY published_at desc LIMIT 0, 2
SELECT count(posts.id) AS count_posts_id FROM `posts` WHERE (`posts`.user_id = 1) AND ((`posts`.user_id = 1) AND (published_as = 'live'))

  def show
    @rss_title = "#{AppConfig.community_name}: #{@user.login}'s posts"
    @rss_url = user_posts_path(@user,:format => :rss)

    @post = Post.find(params[:id])
    @user = @post.user
    @is_current_user = @user.eql?(current_user)
    @comment = Comment.new(params[:comment])

    @comments = @post.comments.find(:all, :limit => 20, :order => 'created_at DESC', :include => :user)

    @previous = @post.previous_post
    @next = @post.next_post
    @popular_posts = @user.posts.find(:all, :limit => 10, :order => "view_count DESC")
---
SELECT * FROM `posts` WHERE (`posts`.user_id = 1 AND (published_at < '2009-09-15 15:15:48' and published_as = 'live')) ORDER BY published_at DESC, published_at desc LIMIT 1
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'Post') ORDER BY created_at DESC LIMIT 20
SELECT * FROM `users` WHERE (`users`.`id` = 10) AND (users.activated_at IS NOT NULL)
SELECT DISTINCT posts.* FROM `posts` INNER JOIN taggings posts_taggings ON posts_taggings.taggable_id = posts.id AND posts_taggings.taggable_type = 'Post' INNER JOIN tags posts_tags ON posts_tags.id = posts_taggings.tag_id WHERE (posts.id != 1 AND published_as = 'live' AND (posts_tags.name LIKE 'teste')) AND (published_as = 'live') ORDER BY published_at DESC LIMIT 8
SELECT count(*) AS count_all FROM `posts` WHERE (`posts`.user_id = 1)

  def update_views
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def new
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)

  def create
    @user = User.find(params[:user_id])
    @post = Post.new(params[:post])
    @post.user = @user
    @post.tag_list = params[:tag_list] || ''

    respond_to do |format|
      if @post.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `posts` (`updated_at`, `title`, `post`, `emailed_count`, `raw_post`, `category_id`, `favorited_count`, `published_as`, `user_id`, `published_at`, `created_at`, `view_count`, `contest_id`) VALUES('2009-09-20 15:19:19', 'dude', 'rawness', 0, 'rawness', 4, 0, 'draft', 1, NULL, '2009-09-20 15:19:19', 0, 1)
INSERT INTO `tags` (`name`) VALUES('tag1')

  def update
    @post = Post.find(params[:id])
    @user = @post.user
    @post.tag_list = params[:tag_list] || ''

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `title` = 'changed_name', `updated_at` = '2009-09-20 15:20:03' WHERE `id` = 1
UPDATE `users` SET `activities_count` = 1, `updated_at` = '2009-09-20 15:20:03' WHERE `id` = 1

  def destroy
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1

  def send_to_friend
    unless params[:emails]
      render :partial => 'posts/send_to_friend', :locals => {:user_id => params[:user_id], :post_id => params[:post_id]} and return
    end
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def popular
    @posts = Post.find_popular({:limit => 15, :since => 3.days})
---
SELECT * FROM `posts` WHERE ((posts.published_at > '2009-09-17 15:19:20') AND (published_as = 'live')) ORDER BY posts.view_count DESC LIMIT 15

  def recent
    @posts = Post.recent.find :all, :page => {:current => params[:page], :size => 20}

    #@recent_clippings = Clipping.find_recent(:limit => 15)
    @recent_photos = Photo.find_recent(:limit => 10)
---
SELECT * FROM `posts` WHERE (published_as = 'live') ORDER BY posts.published_at DESC LIMIT 0, 4
SELECT count(posts.id) AS count_posts_id FROM `posts` WHERE (published_as = 'live')
SELECT * FROM `photos` WHERE (photos.created_at > '2009-09-13 15:15:24' AND photos.parent_id IS NULL) ORDER BY photos.created_at DESC LIMIT 10

  def featured
    @posts = Post.by_featured_writers.recent.find(:all, :page => {:current => params[:page]})
---
SELECT * FROM `pages` WHERE (published_as = 'live')