app/controllers/sb_posts_controller.rb

SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    conditions = []
    [:user_id, :forum_id].each { |attr| conditions << SbPost.send(:sanitize_sql, ["sb_posts.#{attr} = ?", params[attr].to_i]) if params[attr] }
    conditions = conditions.any? ? conditions.collect { |c| "(#{c})" }.join(' AND ') : nil

    @posts = SbPost.with_query_options.paginate(:conditions => conditions, :page => params[:page])

    @users = User.find(:all, :select => 'distinct *', :conditions => ['id in (?)', @posts.collect(&:user_id).uniq]).index_by(&:id)

SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT distinct * FROM `users` WHERE (id in (11,2))
---
  def search
    conditions = params[:q].blank? ? nil : SbPost.send(:sanitize_sql, ['LOWER(sb_posts.body) LIKE ?', "%#{params[:q]}%"])

    @posts = SbPost.with_query_options.find :all, :conditions => conditions, :page => {:current => params[:page]}

    @users = User.find(:all, :select => 'distinct *', :conditions => ['id in (?)', @posts.collect(&:user_id).uniq]).index_by(&:id)

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT `topics`.* FROM `topics` INNER JOIN `monitorships` ON `topics`.id = `monitorships`.topic_id WHERE ((`monitorships`.user_id = 2) AND ((monitorships.active = 1))) ORDER BY topics.replied_at desc LIMIT 25
SELECT count(sb_posts.id) AS count_sb_posts_id FROM `sb_posts` inner join topics on sb_posts.topic_id = topics.id inner join forums on topics.forum_id = forums.id INNER JOIN monitorships ON monitorships.topic_id = topics.id WHERE (monitorships.user_id = '2' AND sb_posts.user_id != 2)
SELECT sb_posts.*, topics.title as topic_title, forums.name as forum_name FROM `sb_posts` inner join topics on sb_posts.topic_id = topics.id inner join forums on topics.forum_id = forums.id INNER JOIN monitorships ON monitorships.topic_id = topics.id WHERE (monitorships.user_id = '2' AND sb_posts.user_id != 2) ORDER BY sb_posts.created_at desc LIMIT 0, 1
---
  def monitored
    @user = User.find params[:user_id]
    @posts = SbPost.with_query_options.find(:all,
                                            :joins => ' INNER JOIN monitorships ON monitorships.topic_id = topics.id',
                                            :conditions  => ['monitorships.user_id = ? AND sb_posts.user_id != ?', params[:user_id], @user.id],
                                            :page => {:current => params[:page]})

SELECT * FROM `topics` WHERE (`topics`.`forum_id` = 2 AND `topics`.`id` = 6) LIMIT 1
INSERT INTO `sb_posts` (`topic_id`, `updated_at`, `body_html`, `body`, `forum_id`, `user_id`, `created_at`) VALUES(1, '2009-09-20 15:21:04', 'blah', 'blah', 1, 2, '2009-09-20 15:21:04')
---
  def create
    authorize! :read, @space
    @topic = Topic.find_by_id_and_forum_id(params[:topic_id].to_i, params[:forum_id].to_i, :include => :forum)
    if @topic.locked?
      respond_to do |format|
        format.html do
          flash[:notice] = :this_topic_is_locked.l
          redirect_to(forum_topic_path(:forum_id => params[:forum_id], :id => params[:topic_id]))
        end
        format.xml do
          render :text => :this_topic_is_locked.l, :status => 400
        end
      end
      return
    end
    @forum = @topic.forum
    @post  = @topic.sb_posts.build(params[:sb_post])
    @post.user = current_user
    @post.space = @space
    @post.save!

UPDATE `sb_posts` SET `body_html` = 'what? pdi', `updated_at` = '2009-09-20 15:21:04' WHERE `id` = 2
---
  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM `sb_posts` WHERE `id` = 2
DELETE FROM `topics` WHERE `id` = 8
---
  def destroy
    @post.destroy
    flash[:notice] = :sb_post_was_deleted.l_with_args(:title => CGI::escapeHTML(@post.topic.title))
    # check for posts_count == 1 because its cached and counting the currently deleted post
    @post.topic.destroy and redirect_to space_forum_path(:space_id => params[:space_id], :forum_id => params[:forum_id]) if @post.topic.sb_posts_count == 1

SELECT * FROM `sb_posts` WHERE (`sb_posts`.`topic_id` = 6 AND `sb_posts`.`forum_id` = 2 AND `sb_posts`.`id` = 7) LIMIT 1
---
  def find_post
    @space = Space.find(params[:space_id])
    forum = @space.forum
    @post = SbPost.find_by_id_and_topic_id_and_forum_id(params[:id].to_i, params[:topic_id].to_i, forum.id) || raise(ActiveRecord::RecordNotFound)