app/controllers/schools_controller.rb

SELECT * FROM `schools` WHERE (`schools`.`id` = 1)
---
  def set_theme
    @school = School.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
SELECT `user_school_associations`.* FROM `user_school_associations` INNER JOIN `access_keys` ON `access_keys`.id = `user_school_associations`.access_key_id WHERE (access_keys.key = '5739d5') LIMIT 1
UPDATE `user_school_associations` SET `user_id` = 5, `updated_at` = '2009-10-04 21:21:38' WHERE `id` = 7
---
  def associate
    @school = School.find(params[:id])
    @user = User.find(params[:user_id])  # TODO precisa mesmo recuperar o usuário no bd?

    #@user_school_association = UserSchoolAssociation.find(:first, :joins => :access_key, :conditions => ["access_keys.key = ?", params[:user_key]])
    @user_school_association = UserSchoolAssociation.find(:first, :include => :access_key, :conditions => ["access_keys.key = ?", params[:user_key]])

    if @user_school_association

      if @user_school_association.access_key.expiration_date.to_time < Time.now # verifica a data da validade da chave

        if @school &&  @user_school_association.school == @school

          if @user && !@user_school_association.user # cada chave só poderá ser usada uma vez, sem troca de aluno


            @user_school_association.user = @user

            if @user_school_association.save

SELECT * FROM `categories`
SELECT * FROM `schools`
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    cond = Caboose::EZ::Condition.new
    cond.append ["area_id = ?", params[:area]] if params[:area] and params[:area].downcase != 'all'
    cond.append ["audience_id = ?", params[:audience]] if params[:audience]



     paginating_params = {
      :conditions => cond.to_sql,
      :page => params[:page],
      :order => (params[:sort]) ? params[:sort] + ' DESC' : 'created_at DESC',
      :per_page => 12
    }

    @schools =  School.redu_categories_id(params[:area]).paginate(paginating_params) if params[:area] and params[:area].downcase != 'all'



    if params[:user_id] # aulas do usuario
      @user = User.find_by_login(params[:user_id])
      @user = User.find(params[:user_id]) unless @user

SELECT * FROM `pages` WHERE (published_as = 'live')
---
  def show
    @school = School.find(params[:id])

    if @school.removed
        redirect_to removed_page_path and return
    end


    if @school
      @statuses = @school.recent_activity(0,10)

      @featured = @school.featured_courses(3)
      @brand_new = @school.courses.find(:first, :order => "created_at DESC")
      @courses = @school.courses.paginate(:conditions =>
        ["published = 1"],
        :include => :owner,
        :page => params[:page],
        :order => 'updated_at DESC',
        :per_page => AppConfig.items_per_page)

INSERT INTO `schools` (`name`, `updated_at`, `description`, `created_at`) VALUES('fazendo acontecer', '2009-09-21 11:34:00', NULL, '2009-09-21 11:34:00')
---
  def create

    session[:school_params].deep_merge!(params[:school]) if params[:school]
  @school = School.new(session[:school_params])
  @school.owner = current_user
  @school.current_step = session[:school_step]
  if @school.valid?
    if params[:back_button]
      @school.previous_step
    elsif @school.last_step?
      @school.save if @school.all_valid?