app/controllers/schools_controller.rb

  def index

    if params[:user_id] # redes do usuario
      @user = User.find(params[:user_id])
      @schools = @user.schools.paginate(
      :include => :owner,
      :page => params[:page],
      :order => 'updated_at DESC',
      :per_page => AppConfig.items_per_page)
---
SELECT * FROM `pages` WHERE (published_as = 'live')