app/controllers/sessions_controller.rb

          @invitation = Invitation.find_by_token(params[:friendship_invitation_token])
          @invitation_user = @invitation.user
          uca = UserCourseAssociation.where(:user_id => @invitation_user).approved
          @contacts = {:total => @invitation_user.friends.count}
---
SELECT count(*) AS count_all FROM `users` WHERE (metro_area_id = 1)