app/controllers/statistics_controller.rb

  def index
    @total_users = User.count(:conditions => ['activated_at IS NOT NULL'])
    @unactivated_users = User.count(:conditions => ['activated_at IS NULL'])
    @yesterday_new_users = find_new_users(1.day.ago.midnight, Date.today.midnight)
    @today_new_users = find_new_users(Date.today.midnight, Date.today.tomorrow.midnight)
    @active_users_count = Activity.count(:all, :group => "user_id", :conditions => ["created_at > ?", 1.month.ago]).size

   # @active_users = User.find_by_activity({:since => 1.month.ago})
    @active_users = User.all

    @percent_reporting_zip = (User.count(:all, :conditions => "zip IS NOT NULL") / @total_users.to_f)*100

    users_reporting_gender = User.count(:all, :conditions => "gender IS NOT NULL")
    @percent_male = (User.count(:all, :conditions => ['gender = ?', User::MALE ]) / users_reporting_gender.to_f) * 100
    @percent_female = (User.count(:all, :conditions => ['gender = ?', User::FEMALE] ) / users_reporting_gender.to_f) * 100

    @featured_writers = User.find_featured

    @posts = Post.find(:all,
      :conditions => ['? <= posts.published_at AND posts.published_at <= ? AND users.featured_writer = ?', Time.now.beginning_of_month, (Time.now.end_of_month + 1.day), true], :include => :user)
---
SELECT * FROM `users` WHERE ((activated_at IS NOT NULL) AND created_at >= '2009-09-19 00:00:00' AND created_at <= '2009-09-20 00:00:00')
SELECT count(*) AS count_all FROM `users` WHERE (activated_at IS NOT NULL)
SELECT count(*) AS count_all, user_id AS user_id FROM `activities` WHERE (created_at > '2009-08-20 15:21:27') GROUP BY user_id
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def activities_chart
    range = (params[:range].blank? ? 10 : params[:range].to_i ) #days

    chart = Ziya::Charts::Line.new
    @logins = Activity.count(:group => "date(created_at)", :conditions => ["action = ? AND created_at > ?", 'logged_in', range.days.ago ] )
---
SELECT count(*) AS count_all, date(created_at) AS date_created_at FROM `activities` WHERE (action = 'logged_in' AND created_at > '2009-09-10 15:21:27') GROUP BY date(created_at)

  def find_new_users(from, to, limit= nil)
    new_user_cond = Caboose::EZ::Condition.new
    new_user_cond << ["activated_at IS NOT NULL"]
    new_user_cond.created_at >= from
    new_user_cond.created_at <= to
    return User.find(:all, :conditions => new_user_cond.to_sql, :limit => limit)
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1