app/controllers/subjects_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `subjects`
---
  def index
    session[:subject_step] = session[:subject_params]= session[:subject_aulas]= session[:subject_id]= session[:subject_exames]  = nil
    cond = Caboose::EZ::Condition.new

    paginating_params = {
      :conditions => cond.to_sql,
      :page => params[:page],
      :order => (params[:sort]) ? params[:sort] + ' DESC' : 'created_at DESC',
      :per_page => AppConfig.items_per_page
    }

    if params[:user_id] # cursos do usuario
      @user = User.find_by_login(params[:user_id])
      @user = User.find(params[:user_id]) unless @user
      @subjects = @user.subjects.paginate(paginating_params)

INSERT INTO `subjects` (`name`, `updated_at`, `created_at`) VALUES('Matematica', '2009-10-02 19:15:22', '2009-10-02 19:15:22')
---
  def create

    if params[:subject]
      # Evita duplicação dos campos gerados dinamicamente no passo 2
      if params[:subject].has_key?(:lazy_assets_attributes)
        session[:subject_params].delete("lazy_assets_attributes")
      end
      # Atualizando dados da sessão
      session[:subject_params].deep_merge!(params[:subject])
    end

    @subject = current_user.subjects.new(session[:subject_params])
    # Evita que ao dar refresh vá para o proximo passo.
    @subject.current_step = params[:step]

    # Redirecionando para o passo especificado
    @subject.enable_correct_validation_group!
    @subject.lazy_assets.each do |asset|
      asset.enable_correct_validation_group!
    end

      debugger
    if params[:back_button]
      @subject.previous_step
    elsif  @subject.valid?
      if @subject.last_step?
        # No último passo, verifica se está tudo ok para salvar.
        if @subject.all_valid?
          @subject.save

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
  def find_subject
   @subject = Subject.find(params[:id])