app/controllers/tags_controller.rb

  def auto_complete_for_tag_name
    @tags = Tag.find(:all, :conditions => [ 'LOWER(name) LIKE ?', '%' + (params[:id] || params[:tag_list]) + '%' ])
---
SELECT * FROM `tags` WHERE (LOWER(name) LIKE '%mis%')

  def show
    tag_names = URI::decode(params[:id])

    @tags = Tag.find(:all, :conditions => [ 'name IN (?)', TagList.from(tag_names) ] )
    if @tags.nil? || @tags.empty?
      flash[:notice] = :tag_does_not_exists.l_with_args(:tag => tag_names)
      redirect_to :action => :index and return
    end
    @related_tags = @tags.collect { |tag| tag.related_tags }.flatten.uniq
    @tags_raw = @tags.collect { |t| t.name } .join(',')

    if params[:type]
      case params[:type]
      when 'Post', 'posts'
        @pages = @posts = Post.recent.find_tagged_with(tag_names, :match_all => true, :page => {:size => 20, :current => params[:page]})
        @photos, @users = [], []
      when 'Photo', 'photos'
        @pages = @photos = Photo.recent.find_tagged_with(tag_names, :match_all => true, :page => {:size => 30, :current => params[:page]})
        @posts, @users = [], []
      when 'User', 'users'
        @pages = @users = User.recent.find_tagged_with(tag_names, :match_all => true, :page => {:size => 30, :current => params[:page]})
        @posts, @photos = [], []
      else
        @clippings, @posts, @photos, @users = [], [], [], []
      end
    else
      @posts = Post.recent.find_tagged_with(tag_names, :match_all => true, :limit => 5)
      @photos = Photo.recent.find_tagged_with(tag_names, :match_all => true, :limit => 10)
      @users = User.recent.find_tagged_with(tag_names, :match_all => true, :limit => 10).uniq
---
SELECT * FROM `tags` WHERE (name IN ('tag_that_does_not_exist'))
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT DISTINCT photos.* FROM `photos` INNER JOIN taggings photos_taggings ON photos_taggings.taggable_id = photos.id AND photos_taggings.taggable_type = 'Photo' INNER JOIN tags photos_tags ON photos_tags.id = photos_taggings.tag_id WHERE ( (SELECT COUNT(*) FROM taggings
SELECT DISTINCT posts.* FROM `posts` INNER JOIN taggings posts_taggings ON posts_taggings.taggable_id = posts.id AND posts_taggings.taggable_type = 'Post' INNER JOIN tags posts_tags ON posts_tags.id = posts_taggings.tag_id WHERE ( (SELECT COUNT(*) FROM taggings
SELECT DISTINCT users.* FROM `users` INNER JOIN taggings users_taggings ON users_taggings.taggable_id = users.id AND users_taggings.taggable_type = 'User' INNER JOIN tags users_tags ON users_tags.id = users_taggings.tag_id WHERE ( (SELECT COUNT(*) FROM taggings