app/controllers/topics_controller.rb

SELECT * FROM `forums` WHERE (`forums`.`id` = 1)
SELECT * FROM `topics` WHERE (`topics`.forum_id = 1) ORDER BY sticky desc, replied_at desc, sticky desc, replied_at desc LIMIT 25
---
  def index
    @forum = Forum.find(params[:forum_id])
    respond_to do |format|
      format.html { redirect_to forum_path(params[:forum_id]) }
      format.xml do
        @topics = @forum.topics.find(:all, :order => 'locked desc, replied_at desc', :limit => 25)

UPDATE `users` SET sb_last_seen_at = '2009-09-20 15:21:49' WHERE (id = 2)
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `sb_posts` WHERE (`sb_posts`.topic_id = 4) AND (`sb_posts`.topic_id = 4) ORDER BY sb_posts.created_at LIMIT 0, 1
SELECT count(DISTINCT sb_posts.id) AS count_sb_posts_id FROM `sb_posts` LEFT OUTER JOIN `users` ON `users`.id = `sb_posts`.user_id WHERE (`sb_posts`.topic_id = 4) AND (`sb_posts`.topic_id = 4)
SELECT * FROM `topics` WHERE (`topics`.`id` = 1 AND (`topics`.forum_id = 1)) ORDER BY sticky desc, replied_at desc
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def show
    respond_to do |format|
      format.html do
        # see notes in base_controller.rb on how this works
        current_user.update_last_seen_at if logged_in?
        # keep track of when we last viewed this topic for activity indicators
        (session[:topics] ||= {})[@topic.id] = Time.now.utc if logged_in?
        # authors of topics don't get counted towards total hits
        @topic.hit! unless logged_in? and @topic.user == current_user

        @posts = @topic.sb_posts.recent.paginate(:page => params[:page],
                                                 :include => :user,
                                                 :order => 'created_at',
                                                 :per_page => AppConfig.items_per_page)

        @voices = @posts.map(&:user)
        @voices.uniq!
        @post   = SbPost.new
      end
      format.js do
        @posts = @topic.sb_posts.recent.paginate(:page => params[:page],
                                                 :include => :user,
                                                 :order => 'created_at',
                                                 :per_page => AppConfig.items_per_page)

      end
      format.xml do
        render :xml => @topic.to_xml
      end
      format.rss do
        @posts = @topic.sb_posts.find(:all, :order => 'created_at desc', :limit => 25)

INSERT INTO `sb_posts` (`topic_id`, `updated_at`, `body_html`, `body`, `forum_id`, `user_id`, `created_at`) VALUES(13, '2009-09-20 15:21:49', 'foo', 'foo', 1, 4, '2009-09-20 15:21:49')
INSERT INTO `tags` (`name`) VALUES('tag1')
INSERT INTO `topics` (`hits`, `updated_at`, `title`, `replied_at`, `last_post_id`, `forum_id`, `replied_by`, `user_id`, `sb_posts_count`, `sticky`, `created_at`, `locked`) VALUES(0, '2009-09-20 15:21:49', 'blah2', '2009-09-20 15:21:49', NULL, 1, NULL, 4, 0, 1, '2009-09-20 15:21:49', 1)
---
  def create
    @space = Space.find(params[:space_id])
    # this is icky - move the topic/first post workings into the topic model?
    Topic.transaction do
      @topic = @forum.topics.build(params[:topic])
      assign_protected
      @post = @topic.sb_posts.build(params[:topic])
      @post.topic = @topic
      @post.user = current_user
      # only save topic if post is valid so in the view topic will be a new record if there was an error
      @topic.tag_list = params[:topic][:tag_list] || ''
      if @post.valid?
        @topic.save

UPDATE `topics` SET `locked` = NULL, `sticky` = NULL, `updated_at` = '2009-09-20 15:21:50' WHERE `id` = 4
---
  def update
    @space = Space.find(params[:space_id])
    assign_protected

    respond_to do |format|
     if @topic.update_attributes(params[:topic])

DELETE FROM `topics` WHERE `id` = 1
---
  def destroy
    @space = @topic.forum.space
    @topic.destroy

SELECT * FROM `forums` WHERE (`forums`.`id` = 2)
SELECT `topics`.* FROM `topics` INNER JOIN `monitorships` ON `topics`.id = `monitorships`.topic_id WHERE (`topics`.`id` = 1) AND ((`monitorships`.user_id = 2) AND ((monitorships.active = 1))) ORDER BY topics.replied_at desc LIMIT 1
---
    def find_forum_and_topic
      @space = Space.find(params[:space_id])
      @forum = @space.forum
      @topic = @forum.topics.find(params[:id]) if params[:id]