app/controllers/users_controller.rb

UPDATE `users` SET `created_at` = '2009-09-20 15:24:10', `login` = 'quire', `crypted_password` = '241e978a33cc5ecb64e1818b57687009decf56bf', `login_slug` = 'quire', `activation_code` = '2d375980891d775ed0da11dc37d56e142c2f6006', `salt` = 'ed0bdc9c3d291204d27d8ce76e610236959beedb', `role_id` = 3, `birthday` = '1994-09-20', `last_login_at` = '2009-09-20 15:24:10', `email` = 'quire@example.com', `updated_at` = '2009-09-20 15:24:10' WHERE `id` = 14
---
  def create
    @user = User.new(params[:user])
    if @user.save
      @user.create_settings!
      if @key
        @key.user = @user
        @key.save

INSERT INTO `tags` (`name`) VALUES('tag1')
SELECT * FROM `users`
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'User') AND (`taggings`.taggable_id = 1))
---
  def update
    @user.attributes = params[:user]

    @user.tag_list = params[:tag_list] || ''

    if @user.errors.empty? && @user.save

SELECT count(*) AS count_all FROM `users` WHERE (metro_area_id = 1)
---
  def update_account
    # Password atual não pode ficar em branco
    if params[:current_password].blank?
      # Só adiciona este erro se o usuário estiver tentando alterar sua senha
      if (!params[:user][:password].blank? ||
          !params[:user][:password_confirmation].blank?)
        @user.errors.add(:current_password, "A senha atual não pode ser deixada em branco.")
        params[:user][:password] = ""
        params[:user][:password_confirmation] = ""
      end
    else
      # Só altera a senha se o password atual estiver certo
      unless @user.valid_password? params[:current_password]
        @user.errors.add(:current_password, "A senha atual está errada.")
        params[:user][:password] = ""
        params[:user][:password_confirmation] = ""
      end
    end

    @user.attributes = params[:user]
    if @user.errors.empty? && @user.save