app/controllers/users_controller.rb

  def follows
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1

  def followers
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1

  def activate
    redirect_to signup_path and return if params[:id].blank?
    @user = User.find_by_activation_code(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = '49275317221d5b05ec276142ef63bbe7c682cfb2') LIMIT 1

  def index
    cond, @search, @metro_areas, @states = User.paginated_users_conditions_with_search(params)

    @users = User.recent.find(:all,
      :conditions => cond.to_sql,
      :include => [:tags],
      :page => {:current => params[:page], :size => 20}
      )
---
SELECT * FROM `pages` WHERE (published_as = 'live')
SELECT * FROM `users` WHERE ((activated_at IS NOT NULL ) AND (metro_area_id = '5')) ORDER BY users.created_at DESC LIMIT 0, 2
SELECT count(DISTINCT users.id) AS count_users_id FROM `users` LEFT OUTER JOIN `taggings` ON (`users`.`id` = `taggings`.`taggable_id` AND `taggings`.`taggable_type` = 'User') LEFT OUTER JOIN `tags` ON (`tags`.`id` = `taggings`.`tag_id`) WHERE ((activated_at IS NOT NULL ) AND (metro_area_id = '5'))
SELECT tags.id, tags.name, COUNT(*) AS count FROM `tags` INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN users ON users.id = taggings.taggable_id WHERE (taggings.taggable_type = 'User') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0 LIMIT 10

  def show
    @friend_count               = @user.accepted_friendships.count
    @accepted_friendships       = @user.accepted_friendships.find(:all, :limit => 5).collect{|f| f.friend }
    @pending_friendships_count  = @user.pending_friendships.count()

    @comments       = @user.comments.find(:all, :limit => 10, :order => 'created_at DESC')
    @photo_comments = Comment.find_photo_comments_for(@user)
    @users_comments = Comment.find_comments_by_user(@user, :limit => 5)

    @recent_posts   = @user.posts.find(:all, :limit => 2, :order => "published_at DESC")
    @clippings      = @user.clippings.find(:all, :limit => 5)
    @photos         = @user.photos.find(:all, :limit => 5)
    @comment        = Comment.new(params[:comment])

    @my_activity = Activity.recent.by_users([@user.id]).find(:all, :limit => 10)
---
SELECT count(*) AS count_all FROM `friendships` WHERE (`friendships`.user_id = 1 AND (initiator = 0 AND friendship_status_id = 1))
SELECT * FROM `friendships` WHERE (`friendships`.user_id = 1 AND (friendship_status_id = 2)) LIMIT 5
SELECT * FROM `comments` WHERE (`comments`.commentable_id = 1 AND `comments`.commentable_type = 'User') ORDER BY created_at DESC LIMIT 10
SELECT * FROM `photos` WHERE (`photos`.user_id = 1) ORDER BY created_at desc LIMIT 5
SELECT * FROM `users` WHERE (`users`.`id` = 10) AND (users.activated_at IS NOT NULL)
SELECT * FROM `posts` WHERE (`posts`.user_id = 1) AND (published_as = 'live') ORDER BY published_at DESC, published_at desc LIMIT 2
SELECT * FROM `clippings` WHERE (`clippings`.user_id = 1) ORDER BY created_at desc LIMIT 5
SELECT * FROM `activities` WHERE (activities.user_id in (1)) ORDER BY activities.created_at DESC LIMIT 10

  def create
    @user       = User.new(params[:user])
    @user.role  = Role[:member]



    if (!AppConfig.require_captcha_on_signup || verify_recaptcha(@user)) && @user.save
---
INSERT INTO "users" ("salt", "last_login_at", "updated_at", "activated_at", "zip", "crypted_password", "stylesheet", "remember_token_expires_at", "activation_code", "country_id", "role_id", "avatar_id", "login_slug", "gender", "description", "remember_token", "metro_area_id", "birthday", "activities_count", "vendor", "notify_friend_requests", "featured_writer", "sb_posts_count", "sb_last_seen_at", "login", "state_id", "notify_community_news", "profile_public", "email", "created_at", "view_count", "notify_comments") VALUES('40dcefc548ce4fb6dbf9a6008c2a9cf5553b4b47', NULL, '2009-09-27 17:16:19', NULL, NULL, 'f159e64048209d3ecb6de4c4668ddbadcf33447c', NULL, NULL, '879859d79a1507fae91051828418c4d20a78ea38', NULL, 3, NULL, 'ksiomelo', NULL, NULL, NULL, NULL, '1984-09-27', 0, 'f', 't', 'f', 0, NULL, 'ksiomelo', NULL, 't', 't', 'cks@sls.com', '2009-09-27 17:16:19', 0, 't')
INSERT INTO `roles` (`name`) VALUES('admin')

  def update
    @user.attributes      = params[:user]
    @metro_areas, @states = setup_locations_for(@user)

    unless params[:metro_area_id].blank?
      @user.metro_area  = MetroArea.find(params[:metro_area_id])
      @user.state       = (@user.metro_area && @user.metro_area.state) ? @user.metro_area.state : nil
      @user.country     = @user.metro_area.country if (@user.metro_area && @user.metro_area.country)
    else
      @user.metro_area = @user.state = @user.country = nil
    end

    @avatar       = Photo.new(params[:avatar])
    @avatar.user  = @user

    @user.avatar  = @avatar if @avatar.save
---
SELECT * FROM `metro_areas` WHERE (`metro_areas`.state_id = 1) ORDER BY name
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
SELECT count(*) AS count_all FROM `users` WHERE (metro_area_id = 1)
INSERT INTO `countries` (`name`) VALUES('Abuja')
INSERT INTO `metro_areas` (`name`, `country_id`, `state_id`) VALUES('Abilene', 0, 44)
INSERT INTO `photos` (`name`, `content_type`, `updated_at`, `size`, `thumbnail`, `album_id`, `description`, `filename`, `height`, `user_id`, `parent_id`, `created_at`, `width`, `view_count`) VALUES(NULL, 'image/jpg', '2009-09-20 15:24:49', 16966, NULL, NULL, NULL, 'library.jpg', 300, 1, NULL, '2009-09-20 15:24:49', 142, NULL)
INSERT INTO `states` (`name`) VALUES('AL')

  def destroy
    unless @user.admin? || @user.featured_writer?
      @user.destroy
---
DELETE FROM `users` WHERE `id` = 1

  def upload_profile_photo
    @avatar       = Photo.new(params[:avatar])
    return unless request.put?

    @avatar.user  = @user
    if @avatar.save
      @user.avatar  = @avatar
      @user.save
---
INSERT INTO `photos` (`name`, `content_type`, `updated_at`, `size`, `thumbnail`, `album_id`, `description`, `filename`, `height`, `user_id`, `parent_id`, `created_at`, `width`, `view_count`) VALUES(NULL, 'image/jpg', '2009-09-20 15:25:14', 16966, NULL, NULL, NULL, 'library.jpg', 300, 1, NULL, '2009-09-20 15:25:14', 142, NULL)
UPDATE `users` SET `activities_count` = 1, `updated_at` = '2009-09-20 15:25:14' WHERE `id` = 1

  def update_account
    @user             = current_user
    @user.attributes  = params[:user]

    if @user.save
---
UPDATE `users` SET `login` = 'changed_login', `login_slug` = 'changed-login', `updated_at` = '2009-09-20 15:25:13' WHERE `id` = 1

  def signup_completed
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def welcome_photo
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def welcome_about
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def welcome_invite
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def forgot_password
    return unless request.post?

    @user = User.active.find_by_email(params[:email])
    if @user && @user.reset_password
      UserNotifier.deliver_reset_password(@user)
      @user.save
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'quentin@example.com' AND `users`.id <> 1) LIMIT 1
UPDATE `users` SET `crypted_password` = '7da5441b5db817862637dc6ad24657f2b1260d83', `updated_at` = '2009-09-20 15:25:12' WHERE `id` = 1

  def forgot_username
    return unless request.post?

    if @user = User.active.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'quentin@example.com') AND (users.activated_at IS NOT NULL) LIMIT 1

  def assume
    self.current_user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1

  def return_admin
    unless session[:admin_id].nil? or current_user.admin?
      admin = User.find(session[:admin_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def metro_area_update

    country = Country.find(params[:country_id]) unless params[:country_id].blank?
    state   = State.find(params[:state_id]) unless params[:state_id].blank?
    states  = country ? country.states.sort_by{|s| s.name} : []

    if states.any?
      metro_areas = state ? state.metro_areas.all(:order => "name") : []
---
SELECT * FROM `countries` WHERE (`countries`.`id` IN (1,2,3))
SELECT * FROM `states` WHERE (`states`.`id` = 27)
SELECT * FROM `metro_areas` WHERE (`metro_areas`.state_id = 27) ORDER BY name

  def toggle_featured
    @user = User.find(params[:id])
    @user.toggle!(:featured_writer)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `featured_writer` = 1, `updated_at` = '2009-09-20 15:25:13' WHERE `id` = 1

  def toggle_moderator
    @user = User.find(params[:id])
    @user.role = @user.moderator? ? Role[:member] : Role[:moderator]
    @user.save!
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
UPDATE `users` SET `role_id` = 2, `updated_at` = '2009-09-20 15:25:13' WHERE `id` = 1

  def statistics
    if params[:date]
      date = Date.new(params[:date][:year].to_i, params[:date][:month].to_i)
      @month = Time.parse(date.to_s)
    else
      @month = Date.today
    end

    start_date  = @month.beginning_of_month
    end_date    = @month.end_of_month + 1.day

    @posts = @user.posts.find(:all,
      :conditions => ['? <= published_at AND published_at <= ?', start_date, end_date])
---
SELECT * FROM `posts` WHERE (`posts`.user_id = 8 AND ('2009-09-01' <= published_at AND published_at <= '2009-10-01')) AND (published_as = 'live') ORDER BY published_at desc